//
//  ReadTheArticle.m
//  BoVolumesForipad
//
//  Created by 杨帅 on 2018/5/7.
//  Copyright © 2018年 YS. All rights reserved.
//

#import "ReadTheArticle.h"

@implementation ReadTheArticle{
    BaseLabel * title;
    BaseLabel * subTitle;
}
-(instancetype)init{
    self = [super init];
    if (self) {
        [self setupUI];
    }
    return self;
}
-(void)setupUI{
    self.backgroundColor = RANDOMCOLOR;
    WS(ws);
    title = [[BaseLabel alloc] initWithFrame:CGRectMake(0, 0, 0, 0) LabelTxteColor:LinShiZiTiYanSe LabelFont:TextFont(LinShiFont) TextAlignment:NSTextAlignmentCenter Text:ZHANWEIZI];
    [self addSubview:title];
    
    [title mas_makeConstraints:^(MASConstraintMaker *make) {
        make.centerX.mas_equalTo(ws.mas_centerX);
        make.top.equalTo(ws).with.offset(20);
        make.left.equalTo(ws).with.offset(20);
        make.right.equalTo(ws).with.offset(-20);
    }];
    
    subTitle = [[BaseLabel alloc] initWithFrame:CGRectMake(0, 0, 0, 0) LabelTxteColor:LinShiZiTiYanSe LabelFont:TextFont(LinShiFont) TextAlignment:NSTextAlignmentLeft Text:ZHANWEIZI];
    subTitle.numberOfLines = 0;
    subTitle.text = @"    弄啥嘞觉得那是；理智的打开连接孩子看到快点哈看见了加上加厚大家刷卡机空间都好看将打击哈空间打卡机滑动啊看见好看大口径的卡计划大吉安居客的卡时间段孩子空间都好看加快进度阿克江\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦\n    按时；啊思密达，骂出来卡萨诺快来拿上来看电脑奥斯陆大了圣诞节拉开经典款啦打开啦就是打了卡解放路卡积分拉开房间辣会计法来看世界法兰克三角阀开了房间案件发两块家里空间立刻减肥卡拉胶福利卡解放路卡积分拉开纠纷拉科技法兰克解放路卡积分卡拉胶发拉开纠纷阿拉开纠纷拉克丝总积分垃圾福利卡积分垃圾费奥拉夫就拉开纠纷垃圾拉丝机啦";
    [self addSubview:subTitle];
    
    [subTitle mas_makeConstraints:^(MASConstraintMaker *make) {
        make.centerX.mas_equalTo(ws.mas_centerX);
        make.top.equalTo(self->title.mas_bottom).with.offset(20);
        make.left.equalTo(ws).with.offset(20);
        make.right.equalTo(ws).with.offset(-20);
        make.bottom.mas_equalTo(ws).with.offset(-20);
    }];
    
}
@end
